app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1000000000], ["LIMIT", 1]]
---
      def show

        game = Game.find_by_id(params[:id])

INSERT INTO "users" ("name", "points", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["points", 0], ["game_id", 2], ["created_at", "2020-05-06 14:35:50.647480"], ["updated_at", "2020-05-06 14:35:50.647480"]]
INSERT INTO "games" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2020-05-06 15:06:34.441830"], ["updated_at", "2020-05-06 15:06:34.441830"]]
---
    def create
        game = Game.create(name: params[:name], users: params[:users])