app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
    def show
        user = User.find_by_id(params[:id])

INSERT INTO "users" ("name", "points", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "eefef"], ["points", 0], ["game_id", 2], ["created_at", "2020-05-05 09:02:00.742839"], ["updated_at", "2020-05-05 09:02:00.742839"]]
---
    def create
        user = User.create(name: params[:name], points: 0, game_id: params[:game_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]
UPDATE "users" SET "points" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["points", nil], ["updated_at", "2020-05-05 16:13:19.325559"], ["id", 69]]
---
    def update
        byebug
        user = User.find_by_id(params[:id])
        user.update(name: params[:name], points: [:points], game_id: params[:game_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 70], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 70]]
---
    def destroy
        user = User.find_by_id(params[:id])
        user.destroy